"""
Чат бот с калькулятором по расчету стоимости автомобиля и доп.услуг

# Вывести на экран модели автомобилей с порядковыми номерами из файла


# Далее клиент выбирает надстройку на автомобиль (если такая возможность имеется), если нет то переходим к следующему шагу

# Далее предлагаем набор дополнительного оборудования и опций устанавливаемых в автомобиль (из файла с порядковыми номерами)

# В числе опций есть возможноть заключения сервисного контракта

# Если клиенту нужен сервисный контракт, то включаем его в стоимость и предлагаем выбрать дополнительные услуги из списка

#Если нет, то выводим итоговую стоимость автомобиля

# Если клиенту нужен сервисный контракт, то задаем вопрос на сколько лет (3-5)

# Выводим итоговую стоимость автомобиля

# Предлагаем купить в кредит или лизинг 

# Если нет, то говорим спасибо за использование чат бота


# Если да, то спрашиваем на сколько лет

# Далее выводим стоимость ежемесячного платежа 

На каждом шаге должен работать калькулятор который в итоге посчитает общую стоимость автомоиля

Необходимые библиотеки: pyTelegramBotAPI 


